NTLK.org
#+TITLE: NLTK
#+INCLUDE: ../pdf.org
#+TAGS: AI
#+OPTIONS: toc:2 ^:nil num:5
#+PROPERTY: header-args :eval never-export
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../css/white.css" />
#+EXCLUDE_TAGS: noexport
#+latex:\newpage

* 英文自然語言處理的經典工具: NLTK
** NLTK 進行文本前處理的幾個流程項目：
1) sentence segmentation (斷句)
2) word segmentation (斷詞)
3) pos (詞性標記)
4) lemmatization (字型還原)
5) stopword (停用詞)
6) ner (命名實體辨識)
參考:[fn:1]

** sentence segmentation (斷句)
*** nltk.download('punkt')
#+begin_src python -r -n :results output :exports both
import nltk

text = """I went to Japan. (NOT I went to the Japan.)
He played tennis with Ben. (NOT He played tennis with the Ben.)
They had breakfast at 9 o’clock. (NOT They had a breakfast at 9 o'clock.)
(Some words don't have an article. We don't usually use articles for countries, meals or people.)"""

sentences = nltk.sent_tokenize(text)
sentences

#+end_src
*** word segmentation (斷詞)
#+begin_src python -r -n :results output :exports both
from nltk import word_tokenize
##tokens = word_tokenize(raw)
#tokens = [tokenizer.tokenize(sent) for sent in sentences]
tokens = [word_tokenize(sent) for sent in sentences]
tokens
### pos (詞性標記)
nltk.download('averaged_perceptron_tagger')
pos = [nltk.pos_tag(token) for token in tokens]

#+end_src
*** Python 自然語言處理 NLTK 庫用法入門教程【經典】

指令碼專欄 · 發表 2018-06-26[fn:2]
#+begin_src python -r -n :results output :exports both
from bs4 import BeautifulSoup
import urllib.request
import nltk

response = urllib.request.urlopen('http://php.net/')
html = response.read()
soup = BeautifulSoup(html,"html5lib")
text = soup.get_text(strip=True)

tokens = [t for t in text.split()]
freq = nltk.FreqDist(tokens)
for key,val in freq.items():
  print (str(key) + ':' + str(val))

#+end_src

*** Corpus 語料庫 and WordNet
#+begin_src python -r -n :results output :exports both
# 存取NLTK內建的語料庫Corpus
from nltk.corpus import reuters

files = reuters.fileids()
print(files)

words16097 = reuters.words(['test/16097'])
print(words16097)

words20 = reuters.words(['test/16097'])[:20]
print(words20)

reutersGenres = reuters.categories()
print(reutersGenres)

for w in reuters.words(categories=['bop','cocoa']):
    print(w+' ',end='')
    if(w is '.'):
        print()

#+end_src

*** 1.4　計算布朗語料庫中三種不同類別的特殊疑問詞
#+begin_src python -r -n :results output :exports both
import nltk
from nltk.corpus import brown

print(brown.categories())

genres = ['fiction', 'humor', 'romance']
whwords = ['what', 'which', 'how', 'why', 'when', 'where', 'who']


for i in range(0,len(genres)):
    genre = genres[i]
    print()
    print("Analysing '"+ genre + "' wh words")
    genre_text = brown.words(categories = genre)
    fdist = nltk.FreqDist(genre_text)
    for wh in whwords:
        print(wh + ':', fdist[wh], end=' ')
#+end_src

