NTLK.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-03 Sun 14:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>NLTK</title>
<meta name="author" content="Yung-Chin Yen" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/white.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">NLTK</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf198743">1. 英文自然語言處理的經典工具: NLTK</a>
<ul>
<li><a href="#org224e3de">1.1. NLTK 進行文本前處理的幾個流程項目：</a></li>
<li><a href="#org35af341">1.2. sentence segmentation (斷句)</a></li>
<li><a href="#orgf79f602">1.3. WordNet</a></li>
</ul>
</li>
<li><a href="#orgf63af61">2. 預處理</a>
<ul>
<li><a href="#orgaa0b039">2.1. 3.2　分詞 Tokenization ——學習使用 NLTK 內置的分詞器 inbuilt tokenizers of NLTK</a></li>
<li><a href="#org4afaa14">2.2. 3.3　詞幹提取 Stemming——學習使用 NLTK 內置的詞幹提取器 inbuilt stemmers of NLTK</a></li>
<li><a href="#org6fc257f">2.3. 3.4　詞形還原 Lemmatization——學習使用 NLTK 中的 WordnetLemmatizer 函數</a></li>
<li><a href="#orgb706828">2.4. 3.5　停用詞 Stopwords ——學習使用停用詞語料庫及其應用</a></li>
<li><a href="#org9a8b18e">2.5. 3.6　編輯距離 Edit distance——編寫計算兩個字串之間編輯距離的演算法 writing your own algorithm to find edit distance between two strings</a></li>
<li><a href="#orgbc1dfb9">2.6. 3.7　處理兩篇短文並提取共有詞彙 Processing two short stories and extracting the common vocabulary between two of them</a></li>
</ul>
</li>
<li><a href="#org681e24b">3. 作業:完成文章的練習</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf198743" class="outline-2">
<h2 id="orgf198743"><span class="section-number-2">1.</span> 英文自然語言處理的經典工具: NLTK</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org224e3de" class="outline-3">
<h3 id="org224e3de"><span class="section-number-3">1.1.</span> NLTK 進行文本前處理的幾個流程項目：</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>sentence segmentation (斷句)<br /></li>
<li>word segmentation (斷詞)<br /></li>
<li>pos (詞性標記)<br /></li>
<li>lemmatization (字型還原)<br /></li>
<li>stopword (停用詞)<br /></li>
<li>ner (命名實體辨識)<br /></li>
</ol>
<p>
參考:<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup><br />
</p>
</div>
</div>

<div id="outline-container-org35af341" class="outline-3">
<h3 id="org35af341"><span class="section-number-3">1.2.</span> sentence segmentation (斷句)</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<ol class="org-ol">
<li><a id="orgab67dd6"></a>nltk.download(&rsquo;punkt&rsquo;)<br />
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #51afef;">import</span> nltk
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #dcaeea;">text</span> = <span style="color: #98be65;">"""I went to Japan. (NOT I went to the Japan.)</span>
<span class="linenr"> 4: </span><span style="color: #98be65;">He played tennis with Ben. (NOT He played tennis with the Ben.)</span>
<span class="linenr"> 5: </span><span style="color: #98be65;">They had breakfast at 9 o&#8217;clock. (NOT They had a breakfast at 9 o'clock.)</span>
<span class="linenr"> 6: </span><span style="color: #98be65;">(Some words don't have an article. We don't usually use articles for countries, meals or people.)"""</span>
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span><span style="color: #dcaeea;">sentences</span> = nltk.sent_tokenize(text)
<span class="linenr"> 9: </span>sentences
<span class="linenr">10: </span>
</pre>
</div>
</div>
</li>
<li><a id="orge5cd4cc"></a>word segmentation (斷詞)<br />
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr">1: </span><span style="color: #51afef;">from</span> nltk <span style="color: #51afef;">import</span> word_tokenize
<span class="linenr">2: </span><span style="color: #5B6268;">##</span><span style="color: #5B6268;">tokens = word_tokenize(raw)</span>
<span class="linenr">3: </span><span style="color: #5B6268;">#</span><span style="color: #5B6268;">tokens = [tokenizer.tokenize(sent) for sent in sentences]</span>
<span class="linenr">4: </span><span style="color: #dcaeea;">tokens</span> = [word_tokenize(sent) <span style="color: #51afef;">for</span> sent <span style="color: #51afef;">in</span> sentences]
<span class="linenr">5: </span>tokens
<span class="linenr">6: </span><span style="color: #5B6268;">### </span><span style="color: #5B6268;">pos (&#35422;&#24615;&#27161;&#35352;)</span>
<span class="linenr">7: </span>nltk.download(<span style="color: #98be65;">'averaged_perceptron_tagger'</span>)
<span class="linenr">8: </span><span style="color: #dcaeea;">pos</span> = [nltk.pos_tag(token) <span style="color: #51afef;">for</span> token <span style="color: #51afef;">in</span> tokens]
<span class="linenr">9: </span>
</pre>
</div>
</div>
</li>
<li><a id="org4e9fe4f"></a>Python 自然語言處理 NLTK 庫用法入門教程【經典】<br />
<div class="outline-text-4" id="text-1-2-3">
<p>
指令碼專欄 · 發表 2018-06-26<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup><br />
</p>
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #51afef;">from</span> bs4 <span style="color: #51afef;">import</span> BeautifulSoup
<span class="linenr"> 2: </span><span style="color: #51afef;">import</span> urllib.request
<span class="linenr"> 3: </span><span style="color: #51afef;">import</span> nltk
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #dcaeea;">response</span> = urllib.request.urlopen(<span style="color: #98be65;">'http://php.net/'</span>)
<span class="linenr"> 6: </span><span style="color: #dcaeea;">html</span> = response.read()
<span class="linenr"> 7: </span><span style="color: #dcaeea;">soup</span> = BeautifulSoup(html,<span style="color: #98be65;">"html5lib"</span>)
<span class="linenr"> 8: </span><span style="color: #dcaeea;">text</span> = soup.get_text(strip=<span style="color: #a9a1e1;">True</span>)
<span class="linenr"> 9: </span>
<span class="linenr">10: </span>tokens = [t <span style="color: #51afef;">for</span> t <span style="color: #51afef;">in</span> text.split()]
<span class="linenr">11: </span>freq = nltk.FreqDist(tokens)
<span class="linenr">12: </span><span style="color: #51afef;">for</span> key,val <span style="color: #51afef;">in</span> freq.items():
<span class="linenr">13: </span>  <span style="color: #c678dd;">print</span> (<span style="color: #c678dd;">str</span>(key) + <span style="color: #98be65;">':'</span> + <span style="color: #c678dd;">str</span>(val))
<span class="linenr">14: </span>
</pre>
</div>
</div>
</li>

<li><a id="org4bd3c28"></a>Corpus 語料庫 and WordNet<br />
<div class="outline-text-4" id="text-1-2-4">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #5B6268;"># </span><span style="color: #5B6268;">&#23384;&#21462;NLTK&#20839;&#24314;&#30340;&#35486;&#26009;&#24235;Corpus</span>
<span class="linenr"> 2: </span><span style="color: #51afef;">from</span> nltk.corpus <span style="color: #51afef;">import</span> reuters
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #dcaeea;">files</span> = reuters.fileids()
<span class="linenr"> 5: </span><span style="color: #c678dd;">print</span>(files)
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #dcaeea;">words16097</span> = reuters.words([<span style="color: #98be65;">'test/16097'</span>])
<span class="linenr"> 8: </span><span style="color: #c678dd;">print</span>(words16097)
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #dcaeea;">words20</span> = reuters.words([<span style="color: #98be65;">'test/16097'</span>])[:<span style="color: #da8548; font-weight: bold;">20</span>]
<span class="linenr">11: </span><span style="color: #c678dd;">print</span>(words20)
<span class="linenr">12: </span>
<span class="linenr">13: </span><span style="color: #dcaeea;">reutersGenres</span> = reuters.categories()
<span class="linenr">14: </span><span style="color: #c678dd;">print</span>(reutersGenres)
<span class="linenr">15: </span>
<span class="linenr">16: </span><span style="color: #51afef;">for</span> w <span style="color: #51afef;">in</span> reuters.words(categories=[<span style="color: #98be65;">'bop'</span>,<span style="color: #98be65;">'cocoa'</span>]):
<span class="linenr">17: </span>    <span style="color: #c678dd;">print</span>(w+<span style="color: #98be65;">' '</span>,end=<span style="color: #98be65;">''</span>)
<span class="linenr">18: </span>    <span style="color: #51afef;">if</span>(w <span style="color: #51afef;">is</span> <span style="color: #98be65;">'.'</span>):
<span class="linenr">19: </span>        <span style="color: #c678dd;">print</span>()
<span class="linenr">20: </span>
</pre>
</div>
</div>
</li>

<li><a id="org012e2c0"></a>1.4　計算布朗語料庫中三種不同類別的特殊疑問詞<br />
<div class="outline-text-4" id="text-1-2-5">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #51afef;">import</span> nltk
<span class="linenr"> 2: </span><span style="color: #51afef;">from</span> nltk.corpus <span style="color: #51afef;">import</span> brown
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #c678dd;">print</span>(brown.categories())
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #dcaeea;">genres</span> = [<span style="color: #98be65;">'fiction'</span>, <span style="color: #98be65;">'humor'</span>, <span style="color: #98be65;">'romance'</span>]
<span class="linenr"> 7: </span><span style="color: #dcaeea;">whwords</span> = [<span style="color: #98be65;">'what'</span>, <span style="color: #98be65;">'which'</span>, <span style="color: #98be65;">'how'</span>, <span style="color: #98be65;">'why'</span>, <span style="color: #98be65;">'when'</span>, <span style="color: #98be65;">'where'</span>, <span style="color: #98be65;">'who'</span>]
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span>
<span class="linenr">10: </span><span style="color: #51afef;">for</span> i <span style="color: #51afef;">in</span> <span style="color: #c678dd;">range</span>(<span style="color: #da8548; font-weight: bold;">0</span>,<span style="color: #c678dd;">len</span>(genres)):
<span class="linenr">11: </span>    <span style="color: #dcaeea;">genre</span> = genres[i]
<span class="linenr">12: </span>    <span style="color: #c678dd;">print</span>()
<span class="linenr">13: </span>    <span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"Analysing '"</span>+ genre + <span style="color: #98be65;">"' wh words"</span>)
<span class="linenr">14: </span>    <span style="color: #dcaeea;">genre_text</span> = brown.words(categories = genre)
<span class="linenr">15: </span>    fdist = nltk.FreqDist(genre_text)
<span class="linenr">16: </span>    <span style="color: #51afef;">for</span> wh <span style="color: #51afef;">in</span> whwords:
<span class="linenr">17: </span>        <span style="color: #c678dd;">print</span>(wh + <span style="color: #98be65;">':'</span>, fdist[wh], end=<span style="color: #98be65;">' '</span>)
</pre>
</div>
</div>
</li>
