NTLK.org
*** 1-5 探討網路文本和聊天文本的詞頻分佈
#+begin_src python -r -n :results output :exports both
import nltk
nltk.download('webtext')

from nltk.corpus import webtext
print(webtext.fileids())

fileid = 'singles.txt'
wbt_words = webtext.words(fileid)
fdist = nltk.FreqDist(wbt_words)

print('Count of the maximum appearing word "',fdist.max(),'" : ', fdist[fdist.max()])
print('Total Number of distinct tokens in the bag : ', fdist.N())
print('Following are the most common 10 words in the bag')
print(fdist.most_common(10))
print('Frequency Distribution on Personal Advertisements')
print(fdist.tabulate())
fdist.plot(cumulative=True)

#+end_src

** WordNet
https://zh.wikipedia.org/wiki/WordNet
WordNet 是一個由普林斯頓大學認識科學實驗室在心理學教授喬治·A·米勒的指導下建立和維護的英語字典。開發工作從 1985 年開始，從此以後該項目接受了超過 300 萬美元的資助。
由於它包含了語義信息，所以有別於通常意義上的字典。WordNet 根據詞條的意義將它們分組，每一個具有相同意義的字條組稱為一個 synset。

在 WordNet 中，名詞，動詞，形容詞和副詞各自被組織成一個同義詞的網絡，每個同義詞集合都代表一個基本的語義概念，並且這些集合之間也由各種關係連接。（一個多義詞將出現在它的每個意思的同義詞集合中）。

在 WordNet 的第一版中（標記為 1.x），四種不同詞性的網絡之間並無連接。WordNet 的名詞網絡是第一個發展起來的。

名詞網絡的主幹是蘊涵關係的層次（上位／下位關係），它占據了關係中的將近 80%。層次中的最頂層是 11 個抽象概念，稱為基本類別始點（unique beginners），例如實體（entity，「有生命的或無生命的具體存在」），心理特徵（psychological feature，「生命有機體的精神上的特徵）。名詞層次中最深的層次是 16 個節點。

https://zhuanlan.zhihu.com/p/26527203

中文詞彙網路 (Chinese Wordnet, 以下簡稱中文詞網) 計畫，目的是在提供完整的中文詞義 (sense) 區分與詞彙語意關係知識庫http://lope.linguistics.ntu.edu.tw/cwn/

*** 1.6　使用 WordNet 進行詞義消歧
#+begin_src python -r -n :results output :exports both
from nltk.corpus import wordnet as wn

woman = wn.synset('woman.n.01')
bed = wn.synset('bed.n.01')

print(woman.hypernyms())
woman_paths = woman.hypernym_paths()

for idx, path in enumerate(woman_paths):
    print('\n\nHypernym Path :', idx + 1)
    for synset in path:
        print(synset.name(), ', ', end='')



types_of_beds = bed.hyponyms()
print('\n\nTypes of beds(Hyponyms): ', types_of_beds)

print(sorted(set(lemma.name() for synset in types_of_beds for lemma in synset.lemmas())))

#+end_src

*** 1.7　選擇兩個不同的同義詞集，使用 WordNet 探討上位詞和下位詞的概念
#+begin_src python -r -n :results output :exports both
from nltk.corpus import wordnet as wn

woman = wn.synset('woman.n.01')
bed = wn.synset('bed.n.01')

print(woman.hypernyms())
woman_paths = woman.hypernym_paths()

for idx, path in enumerate(woman_paths):
    print('\n\nHypernym Path :', idx + 1)
    for synset in path:
        print(synset.name(), ', ', end='')



types_of_beds = bed.hyponyms()
print('\n\nTypes of beds(Hyponyms): ', types_of_beds)

print(sorted(set(lemma.name() for synset in types_of_beds for lemma in synset.lemmas())))

#+end_src

*** 1.8　基於 WordNet 計算名詞、動詞、形容詞和副詞的平均多義性
#+begin_src python -r -n :results output :exports both
from nltk.corpus import wordnet as wn
type = 'n'

synsets = wn.all_synsets(type)

lemmas = []
for synset in synsets:
    for lemma in synset.lemmas():
        lemmas.append(lemma.name())

print(len(lemmas))
lemmas = set(lemmas)
print('Total distinct lemmas: ', len(lemmas))

count = 0
for lemma in lemmas:
    count = count + len(wn.synsets(lemma, type))

print('Total senses :',count)
print('Average Polysemy of ', type,': ' ,  count/len(lemmas))

#+end_src
```

* 預處理
- 引言
- 分詞——學習使用 NLTK 內置的分詞器
- 詞幹提取——學習使用 NLTK 內置的詞幹提取器
- 詞形還原——學習使用 NLTK 中的 WordnetLemmatizer 函數
- 停用詞——學習使用停用詞語料庫及其應用
- 編輯距離——編寫計算兩個字串之間編輯距離的演算法
- 處理兩篇短文並提取共有詞彙

