NTLK.html

<li><a id="org0565a42"></a>1-5 探討網路文本和聊天文本的詞頻分佈<br />
<div class="outline-text-4" id="text-1-2-6">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #51afef;">import</span> nltk
<span class="linenr"> 2: </span>nltk.download(<span style="color: #98be65;">'webtext'</span>)
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #51afef;">from</span> nltk.corpus <span style="color: #51afef;">import</span> webtext
<span class="linenr"> 5: </span><span style="color: #c678dd;">print</span>(webtext.fileids())
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #dcaeea;">fileid</span> = <span style="color: #98be65;">'singles.txt'</span>
<span class="linenr"> 8: </span><span style="color: #dcaeea;">wbt_words</span> = webtext.words(fileid)
<span class="linenr"> 9: </span><span style="color: #dcaeea;">fdist</span> = nltk.FreqDist(wbt_words)
<span class="linenr">10: </span>
<span class="linenr">11: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">'Count of the maximum appearing word "'</span>,fdist.<span style="color: #c678dd;">max</span>(),<span style="color: #98be65;">'" : '</span>, fdist[fdist.<span style="color: #c678dd;">max</span>()])
<span class="linenr">12: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">'Total Number of distinct tokens in the bag : '</span>, fdist.N())
<span class="linenr">13: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">'Following are the most common 10 words in the bag'</span>)
<span class="linenr">14: </span><span style="color: #c678dd;">print</span>(fdist.most_common(<span style="color: #da8548; font-weight: bold;">10</span>))
<span class="linenr">15: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">'Frequency Distribution on Personal Advertisements'</span>)
<span class="linenr">16: </span><span style="color: #c678dd;">print</span>(fdist.tabulate())
<span class="linenr">17: </span>fdist.plot(cumulative=<span style="color: #a9a1e1;">True</span>)
<span class="linenr">18: </span>
</pre>
</div>
</div>
</li>
</ol>
</div>

<div id="outline-container-orgf79f602" class="outline-3">
<h3 id="orgf79f602"><span class="section-number-3">1.3.</span> WordNet</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<a href="https://zh.wikipedia.org/wiki/WordNet">https://zh.wikipedia.org/wiki/WordNet</a><br />
WordNet 是一個由普林斯頓大學認識科學實驗室在心理學教授喬治·A·米勒的指導下建立和維護的英語字典。開發工作從 1985 年開始，從此以後該項目接受了超過 300 萬美元的資助。<br />
由於它包含了語義信息，所以有別於通常意義上的字典。WordNet 根據詞條的意義將它們分組，每一個具有相同意義的字條組稱為一個 synset。<br />
</p>

<p>
在 WordNet 中，名詞，動詞，形容詞和副詞各自被組織成一個同義詞的網絡，每個同義詞集合都代表一個基本的語義概念，並且這些集合之間也由各種關係連接。（一個多義詞將出現在它的每個意思的同義詞集合中）。<br />
</p>

<p>
在 WordNet 的第一版中（標記為 1.x），四種不同詞性的網絡之間並無連接。WordNet 的名詞網絡是第一個發展起來的。<br />
</p>

<p>
名詞網絡的主幹是蘊涵關係的層次（上位／下位關係），它占據了關係中的將近 80%。層次中的最頂層是 11 個抽象概念，稱為基本類別始點（unique beginners），例如實體（entity，「有生命的或無生命的具體存在」），心理特徵（psychological feature，「生命有機體的精神上的特徵）。名詞層次中最深的層次是 16 個節點。<br />
</p>

<p>
<a href="https://zhuanlan.zhihu.com/p/26527203">https://zhuanlan.zhihu.com/p/26527203</a><br />
</p>

<p>
中文詞彙網路 (Chinese Wordnet, 以下簡稱中文詞網) 計畫，目的是在提供完整的中文詞義 (sense) 區分與詞彙語意關係知識庫<a href="http://lope.linguistics.ntu.edu.tw/cwn/">http://lope.linguistics.ntu.edu.tw/cwn/</a><br />
</p>
</div>

<ol class="org-ol">
<li><a id="orge682fcd"></a>1.6　使用 WordNet 進行詞義消歧<br />
<div class="outline-text-4" id="text-1-3-1">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #51afef;">from</span> nltk.corpus <span style="color: #51afef;">import</span> wordnet <span style="color: #51afef;">as</span> wn
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #dcaeea;">woman</span> = wn.synset(<span style="color: #98be65;">'woman.n.01'</span>)
<span class="linenr"> 4: </span><span style="color: #dcaeea;">bed</span> = wn.synset(<span style="color: #98be65;">'bed.n.01'</span>)
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #c678dd;">print</span>(woman.hypernyms())
<span class="linenr"> 7: </span><span style="color: #dcaeea;">woman_paths</span> = woman.hypernym_paths()
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span><span style="color: #51afef;">for</span> idx, path <span style="color: #51afef;">in</span> <span style="color: #c678dd;">enumerate</span>(woman_paths):
<span class="linenr">10: </span>    <span style="color: #c678dd;">print</span>(<span style="color: #98be65;">'\n\nHypernym Path :'</span>, idx + <span style="color: #da8548; font-weight: bold;">1</span>)
<span class="linenr">11: </span>    <span style="color: #51afef;">for</span> synset <span style="color: #51afef;">in</span> path:
<span class="linenr">12: </span>        <span style="color: #c678dd;">print</span>(synset.name(), <span style="color: #98be65;">', '</span>, end=<span style="color: #98be65;">''</span>)
<span class="linenr">13: </span>
<span class="linenr">14: </span>
<span class="linenr">15: </span>
<span class="linenr">16: </span>types_of_beds = bed.hyponyms()
<span class="linenr">17: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">'\n\nTypes of beds(Hyponyms): '</span>, types_of_beds)
<span class="linenr">18: </span>
<span class="linenr">19: </span><span style="color: #c678dd;">print</span>(<span style="color: #c678dd;">sorted</span>(<span style="color: #c678dd;">set</span>(lemma.name() <span style="color: #51afef;">for</span> synset <span style="color: #51afef;">in</span> types_of_beds <span style="color: #51afef;">for</span> lemma <span style="color: #51afef;">in</span> synset.lemmas())))
<span class="linenr">20: </span>
</pre>
</div>
</div>
</li>

<li><a id="org1dc3395"></a>1.7　選擇兩個不同的同義詞集，使用 WordNet 探討上位詞和下位詞的概念<br />
<div class="outline-text-4" id="text-1-3-2">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #51afef;">from</span> nltk.corpus <span style="color: #51afef;">import</span> wordnet <span style="color: #51afef;">as</span> wn
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #dcaeea;">woman</span> = wn.synset(<span style="color: #98be65;">'woman.n.01'</span>)
<span class="linenr"> 4: </span><span style="color: #dcaeea;">bed</span> = wn.synset(<span style="color: #98be65;">'bed.n.01'</span>)
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #c678dd;">print</span>(woman.hypernyms())
<span class="linenr"> 7: </span><span style="color: #dcaeea;">woman_paths</span> = woman.hypernym_paths()
<span class="linenr"> 8: </span>
<span class="linenr"> 9: </span><span style="color: #51afef;">for</span> idx, path <span style="color: #51afef;">in</span> <span style="color: #c678dd;">enumerate</span>(woman_paths):
<span class="linenr">10: </span>    <span style="color: #c678dd;">print</span>(<span style="color: #98be65;">'\n\nHypernym Path :'</span>, idx + <span style="color: #da8548; font-weight: bold;">1</span>)
<span class="linenr">11: </span>    <span style="color: #51afef;">for</span> synset <span style="color: #51afef;">in</span> path:
<span class="linenr">12: </span>        <span style="color: #c678dd;">print</span>(synset.name(), <span style="color: #98be65;">', '</span>, end=<span style="color: #98be65;">''</span>)
<span class="linenr">13: </span>
<span class="linenr">14: </span>
<span class="linenr">15: </span>
<span class="linenr">16: </span>types_of_beds = bed.hyponyms()
<span class="linenr">17: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">'\n\nTypes of beds(Hyponyms): '</span>, types_of_beds)
<span class="linenr">18: </span>
<span class="linenr">19: </span><span style="color: #c678dd;">print</span>(<span style="color: #c678dd;">sorted</span>(<span style="color: #c678dd;">set</span>(lemma.name() <span style="color: #51afef;">for</span> synset <span style="color: #51afef;">in</span> types_of_beds <span style="color: #51afef;">for</span> lemma <span style="color: #51afef;">in</span> synset.lemmas())))
<span class="linenr">20: </span>
</pre>
</div>
</div>
</li>

<li><a id="orgd99a9ab"></a>1.8　基於 WordNet 計算名詞、動詞、形容詞和副詞的平均多義性<br />
<div class="outline-text-4" id="text-1-3-3">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #51afef;">from</span> nltk.corpus <span style="color: #51afef;">import</span> wordnet <span style="color: #51afef;">as</span> wn
<span class="linenr"> 2: </span><span style="color: #c678dd;">type</span> = <span style="color: #98be65;">'n'</span>
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #dcaeea;">synsets</span> = wn.all_synsets(<span style="color: #c678dd;">type</span>)
<span class="linenr"> 5: </span>
<span class="linenr"> 6: </span><span style="color: #dcaeea;">lemmas</span> = []
<span class="linenr"> 7: </span><span style="color: #51afef;">for</span> synset <span style="color: #51afef;">in</span> <span style="color: #dcaeea;">synsets</span>:
<span class="linenr"> 8: </span>    <span style="color: #51afef;">for</span> lemma <span style="color: #51afef;">in</span> synset.lemmas():
<span class="linenr"> 9: </span>        lemmas.append(lemma.name())
<span class="linenr">10: </span>
<span class="linenr">11: </span><span style="color: #c678dd;">print</span>(<span style="color: #c678dd;">len</span>(lemmas))
<span class="linenr">12: </span>lemmas = <span style="color: #c678dd;">set</span>(lemmas)
<span class="linenr">13: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">'Total distinct lemmas: '</span>, <span style="color: #c678dd;">len</span>(lemmas))
<span class="linenr">14: </span>
<span class="linenr">15: </span>count = <span style="color: #da8548; font-weight: bold;">0</span>
<span class="linenr">16: </span><span style="color: #51afef;">for</span> lemma <span style="color: #51afef;">in</span> <span style="color: #dcaeea;">lemmas</span>:
<span class="linenr">17: </span>    count = count + <span style="color: #c678dd;">len</span>(wn.synsets(lemma, <span style="color: #c678dd;">type</span>))
<span class="linenr">18: </span>
<span class="linenr">19: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">'Total senses :'</span>,count)
<span class="linenr">20: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">'Average Polysemy of '</span>, <span style="color: #c678dd;">type</span>,<span style="color: #98be65;">': '</span> ,  count/<span style="color: #c678dd;">len</span>(lemmas))
<span class="linenr">21: </span>
</pre>
</div>
<p>
```<br />
</p>
</div>
</li>
</ol>
</div>
</div>

<div id="outline-container-orgf63af61" class="outline-2">
<h2 id="orgf63af61"><span class="section-number-2">2.</span> 預處理</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>引言<br /></li>
<li>分詞——學習使用 NLTK 內置的分詞器<br /></li>
<li>詞幹提取——學習使用 NLTK 內置的詞幹提取器<br /></li>
<li>詞形還原——學習使用 NLTK 中的 WordnetLemmatizer 函數<br /></li>
<li>停用詞——學習使用停用詞語料庫及其應用<br /></li>
<li>編輯距離——編寫計算兩個字串之間編輯距離的演算法<br /></li>
<li>處理兩篇短文並提取共有詞彙<br /></li>
</ul>
</div>
