NTLK.html

<div id="outline-container-orgaa0b039" class="outline-3">
<h3 id="orgaa0b039"><span class="section-number-3">2.1.</span> 3.2　分詞 Tokenization ——學習使用 NLTK 內置的分詞器 inbuilt tokenizers of NLTK</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #51afef;">from</span> nltk.tokenize <span style="color: #51afef;">import</span> LineTokenizer, SpaceTokenizer, TweetTokenizer
<span class="linenr"> 2: </span><span style="color: #51afef;">from</span> nltk <span style="color: #51afef;">import</span> word_tokenize
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #dcaeea;">lTokenizer</span> = LineTokenizer();
<span class="linenr"> 5: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"Line tokenizer output :"</span>,lTokenizer.tokenize(<span style="color: #98be65;">"My name is Maximus Decimus Meridius, commander of the Armies of the North, General of the Felix Legions and loyal servant to the true emperor, Marcus Aurelius. \nFather to a murdered son, husband to a murdered wife. \nAnd I will have my vengeance, in this life or the next."</span>))
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>rawText = <span style="color: #98be65;">"By 11 o'clock on Sunday, the doctor shall open the dispensary."</span>
<span class="linenr"> 8: </span><span style="color: #dcaeea;">sTokenizer</span> = SpaceTokenizer()
<span class="linenr"> 9: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"Space Tokenizer output :"</span>,sTokenizer.tokenize(rawText))
<span class="linenr">10: </span>
<span class="linenr">11: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"Word Tokenizer output :"</span>, word_tokenize(rawText))
<span class="linenr">12: </span>
<span class="linenr">13: </span>tTokenizer = TweetTokenizer()
<span class="linenr">14: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"Tweet Tokenizer output :"</span>,tTokenizer.tokenize(<span style="color: #98be65;">"This is a cooool #dummysmiley: :-) :-P &lt;3"</span>))
<span class="linenr">15: </span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4afaa14" class="outline-3">
<h3 id="org4afaa14"><span class="section-number-3">2.2.</span> 3.3　詞幹提取 Stemming——學習使用 NLTK 內置的詞幹提取器 inbuilt stemmers of NLTK</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #51afef;">from</span> nltk <span style="color: #51afef;">import</span> PorterStemmer, LancasterStemmer, word_tokenize
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #dcaeea;">raw</span> = <span style="color: #98be65;">"My name is Maximus Decimus Meridius, commander of the Armies of the North, General of the Felix Legions and loyal servant to the true emperor, Marcus Aurelius. Father to a murdered son, husband to a murdered wife. And I will have my vengeance, in this life or the next."</span>
<span class="linenr"> 4: </span>
<span class="linenr"> 5: </span><span style="color: #dcaeea;">tokens</span> = word_tokenize(raw)
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span><span style="color: #dcaeea;">porter</span> = PorterStemmer()
<span class="linenr"> 8: </span><span style="color: #dcaeea;">pStems</span> = [porter.stem(t) <span style="color: #51afef;">for</span> t <span style="color: #51afef;">in</span> tokens]
<span class="linenr"> 9: </span><span style="color: #c678dd;">print</span>(pStems)
<span class="linenr">10: </span>
<span class="linenr">11: </span><span style="color: #dcaeea;">lancaster</span> = LancasterStemmer()
<span class="linenr">12: </span><span style="color: #dcaeea;">lStems</span> = [lancaster.stem(t) <span style="color: #51afef;">for</span> t <span style="color: #51afef;">in</span> tokens]
<span class="linenr">13: </span><span style="color: #c678dd;">print</span>(lStems)
</pre>
</div>
</div>
</div>

<div id="outline-container-org6fc257f" class="outline-3">
<h3 id="org6fc257f"><span class="section-number-3">2.3.</span> 3.4　詞形還原 Lemmatization——學習使用 NLTK 中的 WordnetLemmatizer 函數</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span>nltk.download(<span style="color: #98be65;">'gutenberg'</span>)
<span class="linenr"> 2: </span>nltk.download(<span style="color: #98be65;">'stopwords'</span>)
<span class="linenr"> 3: </span>
<span class="linenr"> 4: </span><span style="color: #51afef;">import</span> nltk
<span class="linenr"> 5: </span><span style="color: #51afef;">from</span> nltk.corpus <span style="color: #51afef;">import</span> gutenberg
<span class="linenr"> 6: </span><span style="color: #c678dd;">print</span>(gutenberg.fileids())
<span class="linenr"> 7: </span>
<span class="linenr"> 8: </span><span style="color: #dcaeea;">gb_words</span> = gutenberg.words(<span style="color: #98be65;">'bible-kjv.txt'</span>)
<span class="linenr"> 9: </span><span style="color: #dcaeea;">words_filtered</span> = [e.lower() <span style="color: #51afef;">for</span> e <span style="color: #51afef;">in</span> gb_words <span style="color: #51afef;">if</span> <span style="color: #c678dd;">len</span>(e) &gt;= <span style="color: #da8548; font-weight: bold;">3</span>]
<span class="linenr">10: </span><span style="color: #dcaeea;">stopwords</span> = nltk.corpus.stopwords.words(<span style="color: #98be65;">'english'</span>)
<span class="linenr">11: </span><span style="color: #dcaeea;">words</span> = [w <span style="color: #51afef;">for</span> w <span style="color: #51afef;">in</span> words_filtered <span style="color: #51afef;">if</span> w.lower() <span style="color: #51afef;">not</span> <span style="color: #51afef;">in</span> stopwords]
<span class="linenr">12: </span>
<span class="linenr">13: </span><span style="color: #dcaeea;">fdist</span> = nltk.FreqDist(words)
<span class="linenr">14: </span><span style="color: #dcaeea;">fdist2</span> = nltk.FreqDist(gb_words)
<span class="linenr">15: </span>
<span class="linenr">16: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">'Following are the most common 10 words in the bag'</span>)
<span class="linenr">17: </span><span style="color: #c678dd;">print</span>(fdist2.most_common(<span style="color: #da8548; font-weight: bold;">10</span>))
<span class="linenr">18: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">'Following are the most common 10 words in the bag minus the stopwords'</span>)
<span class="linenr">19: </span><span style="color: #c678dd;">print</span>(fdist.most_common(<span style="color: #da8548; font-weight: bold;">10</span>))
<span class="linenr">20: </span>fdist.plot()
<span class="linenr">21: </span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb706828" class="outline-3">
<h3 id="orgb706828"><span class="section-number-3">2.4.</span> 3.5　停用詞 Stopwords ——學習使用停用詞語料庫及其應用</h3>
</div>
<div id="outline-container-org9a8b18e" class="outline-3">
<h3 id="org9a8b18e"><span class="section-number-3">2.5.</span> 3.6　編輯距離 Edit distance——編寫計算兩個字串之間編輯距離的演算法 writing your own algorithm to find edit distance between two strings</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #51afef;">from</span> nltk.metrics.distance <span style="color: #51afef;">import</span> edit_distance
<span class="linenr"> 2: </span>
<span class="linenr"> 3: </span><span style="color: #51afef;">def</span> <span style="color: #c678dd;">my_edit_distance</span>(str1, str2):
<span class="linenr"> 4: </span>    <span style="color: #dcaeea;">m</span>= <span style="color: #c678dd;">len</span>(str1) + <span style="color: #da8548; font-weight: bold;">1</span>
<span class="linenr"> 5: </span>    <span style="color: #dcaeea;">n</span>= <span style="color: #c678dd;">len</span>(str2) + <span style="color: #da8548; font-weight: bold;">1</span>
<span class="linenr"> 6: </span>
<span class="linenr"> 7: </span>    <span style="color: #dcaeea;">table</span> = {}
<span class="linenr"> 8: </span>    <span style="color: #51afef;">for</span> i <span style="color: #51afef;">in</span> <span style="color: #c678dd;">range</span>(m): <span style="color: #dcaeea;">table</span>[i,<span style="color: #da8548; font-weight: bold;">0</span>]=i
<span class="linenr"> 9: </span>    <span style="color: #51afef;">for</span> j <span style="color: #51afef;">in</span> <span style="color: #c678dd;">range</span>(n): <span style="color: #dcaeea;">table</span>[<span style="color: #da8548; font-weight: bold;">0</span>,j]=j
<span class="linenr">10: </span>
<span class="linenr">11: </span>    <span style="color: #51afef;">for</span> i <span style="color: #51afef;">in</span> <span style="color: #c678dd;">range</span>(<span style="color: #da8548; font-weight: bold;">1</span>, m):
<span class="linenr">12: </span>        <span style="color: #51afef;">for</span> j <span style="color: #51afef;">in</span> <span style="color: #c678dd;">range</span>(<span style="color: #da8548; font-weight: bold;">1</span>, n):
<span class="linenr">13: </span>            <span style="color: #dcaeea;">cost</span> = <span style="color: #da8548; font-weight: bold;">0</span> <span style="color: #51afef;">if</span> str1[i - <span style="color: #da8548; font-weight: bold;">1</span>] == str2[j - <span style="color: #da8548; font-weight: bold;">1</span>] <span style="color: #51afef;">else</span> <span style="color: #da8548; font-weight: bold;">1</span>
<span class="linenr">14: </span>            table[<span style="color: #dcaeea;">i</span>,<span style="color: #dcaeea;">j</span>] = <span style="color: #c678dd;">min</span>(table[i, j-<span style="color: #da8548; font-weight: bold;">1</span>]+<span style="color: #da8548; font-weight: bold;">1</span>, table[i-<span style="color: #da8548; font-weight: bold;">1</span>, j]+<span style="color: #da8548; font-weight: bold;">1</span>, table[i-<span style="color: #da8548; font-weight: bold;">1</span>, j-<span style="color: #da8548; font-weight: bold;">1</span>]+cost)
<span class="linenr">15: </span>
<span class="linenr">16: </span>    <span style="color: #51afef;">return</span> table[i,j]
<span class="linenr">17: </span>
<span class="linenr">18: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"Our Algorithm :"</span>,my_edit_distance(<span style="color: #98be65;">"hand"</span>, <span style="color: #98be65;">"and"</span>))
<span class="linenr">19: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"NLTK Algorithm :"</span>,edit_distance(<span style="color: #98be65;">"hand"</span>, <span style="color: #98be65;">"and"</span>))
<span class="linenr">20: </span>
</pre>
</div>
</div>
</div>
