NTLK.html

<div id="outline-container-orgbc1dfb9" class="outline-3">
<h3 id="orgbc1dfb9"><span class="section-number-3">2.6.</span> 3.7　處理兩篇短文並提取共有詞彙 Processing two short stories and extracting the common vocabulary between two of them</h3>
<div class="outline-text-3" id="text-2-6">
<div class="org-src-container">
<pre class="src src-python"><span class="linenr"> 1: </span><span style="color: #dcaeea;">story1</span> = <span style="color: #98be65;">"""In a far away kingdom, there was a river. This river was home to many golden swans. The swans spent most of their time on the banks of the river. Every six months, the swans would leave a golden feather as a fee for using the lake. The soldiers of the kingdom would collect the feathers and deposit them in the royal treasury.</span>
<span class="linenr"> 2: </span><span style="color: #98be65;">One day, a homeless bird saw the river. "The water in this river seems so cool and soothing. I will make my home here," thought the bird.</span>
<span class="linenr"> 3: </span><span style="color: #98be65;">As soon as the bird settled down near the river, the golden swans noticed her. They came shouting. "This river belongs to us. We pay a golden feather to the King to use this river. You can not live here."</span>
<span class="linenr"> 4: </span><span style="color: #98be65;">"I am homeless, brothers. I too will pay the rent. Please give me shelter," the bird pleaded. "How will you pay the rent? You do not have golden feathers," said the swans laughing. They further added, "Stop dreaming and leave once." The humble bird pleaded many times. But the arrogant swans drove the bird away.</span>
<span class="linenr"> 5: </span><span style="color: #98be65;">"I will teach them a lesson!" decided the humiliated bird.</span>
<span class="linenr"> 6: </span><span style="color: #98be65;">She went to the King and said, "O King! The swans in your river are impolite and unkind. I begged for shelter but they said that they had purchased the river with golden feathers."</span>
<span class="linenr"> 7: </span><span style="color: #98be65;">The King was angry with the arrogant swans for having insulted the homeless bird. He ordered his soldiers to bring the arrogant swans to his court. In no time, all the golden swans were brought to the King&#8217;s court.</span>
<span class="linenr"> 8: </span><span style="color: #98be65;">"Do you think the royal treasury depends upon your golden feathers? You can not decide who lives by the river. Leave the river at once or you all will be beheaded!" shouted the King.</span>
<span class="linenr"> 9: </span><span style="color: #98be65;">The swans shivered with fear on hearing the King. They flew away never to return. The bird built her home near the river and lived there happily forever. The bird gave shelter to all other birds in the river. """</span>
<span class="linenr">10: </span>
<span class="linenr">11: </span><span style="color: #dcaeea;">story2</span> = <span style="color: #98be65;">"""Long time ago, there lived a King. He was lazy and liked all the comforts of life. He never carried out his duties as a King. &#8220;Our King does not take care of our needs. He also ignores the affairs of his kingdom." The people complained.</span>
<span class="linenr">12: </span><span style="color: #98be65;">One day, the King went into the forest to hunt. After having wandered for quite sometime, he became thirsty. To his relief, he spotted a lake. As he was drinking water, he suddenly saw a golden swan come out of the lake and perch on a stone. &#8220;Oh! A golden swan. I must capture it," thought the King.</span>
<span class="linenr">13: </span><span style="color: #98be65;">But as soon as he held his bow up, the swan disappeared. And the King heard a voice, &#8220;I am the Golden Swan. If you want to capture me, you must come to heaven."</span>
<span class="linenr">14: </span><span style="color: #98be65;">Surprised, the King said, &#8220;Please show me the way to heaven." &#8220;Do good deeds, serve your people and the messenger from heaven would come to fetch you to heaven," replied the voice.</span>
<span class="linenr">15: </span><span style="color: #98be65;">The selfish King, eager to capture the Swan, tried doing some good deeds in his Kingdom. &#8220;Now, I suppose a messenger will come to take me to heaven," he thought. But, no messenger came.</span>
<span class="linenr">16: </span><span style="color: #98be65;">The King then disguised himself and went out into the street. There he tried helping an old man. But the old man became angry and said, &#8220;You need not try to help. I am in this miserable state because of out selfish King. He has done nothing for his people."</span>
<span class="linenr">17: </span><span style="color: #98be65;">Suddenly, the King heard the golden swan&#8217;s voice, &#8220;Do good deeds and you will come to heaven." It dawned on the King that by doing selfish acts, he will not go to heaven.</span>
<span class="linenr">18: </span><span style="color: #98be65;">He realized that his people needed him and carrying out his duties was the only way to heaven. After that day he became a responsible King.</span>
<span class="linenr">19: </span><span style="color: #98be65;">"""</span>
<span class="linenr">20: </span>
<span class="linenr">21: </span><span style="color: #dcaeea;">story1</span> = story1.replace(<span style="color: #98be65;">","</span>, <span style="color: #98be65;">""</span>).replace(<span style="color: #98be65;">"\n"</span>, <span style="color: #98be65;">""</span>).replace(<span style="color: #98be65;">'.'</span>, <span style="color: #98be65;">''</span>).replace(<span style="color: #98be65;">'"'</span>, <span style="color: #98be65;">''</span>).replace(<span style="color: #98be65;">"!"</span>,<span style="color: #98be65;">""</span>).replace(<span style="color: #98be65;">"?"</span>,<span style="color: #98be65;">""</span>).casefold()
<span class="linenr">22: </span><span style="color: #dcaeea;">story2</span> = story2.replace(<span style="color: #98be65;">","</span>, <span style="color: #98be65;">""</span>).replace(<span style="color: #98be65;">"\n"</span>, <span style="color: #98be65;">""</span>).replace(<span style="color: #98be65;">'.'</span>, <span style="color: #98be65;">''</span>).replace(<span style="color: #98be65;">'"'</span>, <span style="color: #98be65;">''</span>).replace(<span style="color: #98be65;">"!"</span>,<span style="color: #98be65;">""</span>).replace(<span style="color: #98be65;">"?"</span>,<span style="color: #98be65;">""</span>).casefold()
<span class="linenr">23: </span>
<span class="linenr">24: </span><span style="color: #dcaeea;">story1_words</span> = story1.split(<span style="color: #98be65;">" "</span>)
<span class="linenr">25: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"First Story words :"</span>,story1_words)
<span class="linenr">26: </span>story2_words = story2.split(<span style="color: #98be65;">" "</span>)
<span class="linenr">27: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"Second Story words :"</span>,story2_words)
<span class="linenr">28: </span>
<span class="linenr">29: </span>story1_vocab = <span style="color: #c678dd;">set</span>(story1_words)
<span class="linenr">30: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"First Story vocabulary :"</span>,story1_vocab)
<span class="linenr">31: </span>story2_vocab = <span style="color: #c678dd;">set</span>(story2_words)
<span class="linenr">32: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"Second Story vocabulary"</span>,story2_vocab)
<span class="linenr">33: </span>
<span class="linenr">34: </span><span style="color: #dcaeea;">common_vocab</span> = story1_vocab &amp; story2_vocab
<span class="linenr">35: </span><span style="color: #c678dd;">print</span>(<span style="color: #98be65;">"Common Vocabulary :"</span>,common_vocab)
<span class="linenr">36: </span>
</pre>
</div>
<pre class="example" id="org14eda1e">
['austen-emma.txt', 'austen-persuasion.txt', 'austen-sense.txt', 'bible-kjv.txt', 'blake-poems.txt', 'bryant-stories.txt', 'burgess-busterbrown.txt', 'carroll-alice.txt', 'chesterton-ball.txt', 'chesterton-brown.txt', 'chesterton-thursday.txt', 'edgeworth-parents.txt', 'melville-moby_dick.txt', 'milton-paradise.txt', 'shakespeare-caesar.txt', 'shakespeare-hamlet.txt', 'shakespeare-macbeth.txt', 'whitman-leaves.txt']

Following are the most common 10 words in the bag
[(',', 70509), ('the', 62103), (':', 43766), ('and', 38847), ('of', 34480), ('.', 26160), ('to', 13396), ('And', 12846), ('that', 12576), ('in', 12331)]

Following are the most common 10 words in the bag minus the stopwords
[('shall', 9838), ('unto', 8997), ('lord', 7964), ('thou', 5474), ('thy', 4600), ('god', 4472), ('said', 3999), ('thee', 3827), ('upon', 2748), ('man', 2735)]

</pre>
</div>
</div>
</div>

<div id="outline-container-org681e24b" class="outline-2">
<h2 id="org681e24b"><span class="section-number-2">3.</span> 作業:完成文章的練習</h2>
<div class="outline-text-2" id="text-3">
<p>
Python 自然語言處理 NLTK 庫用法入門教程【經典】<br />
指令碼專欄 · 發表 2018-06-26<br />
<a href="https://www.itread01.com/article/1529980432.html">https://www.itread01.com/article/1529980432.html</a><br />
</p>

<p>
NLTK Python Tutorial (Natural Language Toolkit)<br />
<a href="https://data-flair.training/blogs/nltk-python-tutorial/">https://data-flair.training/blogs/nltk-python-tutorial/</a><br />
```<br />
</p>
</div>
</div>
